In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
import warnings
warnings.filterwarnings(action="ignore")

In [3]:
# Read the data to python environment
df=pd.read_csv("StudentsPerformance_6b665a83e6a7b6a7ee889e89b8ebc83f.csv")
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33
...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100

In [4]:
# Identify the columns
df.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [5]:
# Check the null values
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [6]:
# Renaming the columns
df.rename(columns={"parental level of education":"parental_level_of_education"},inplace=True)

In [7]:
column_names=df.columns
column_names

Index(['gender', 'race/ethnicity', 'parental_level_of_education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [8]:
for column in column_names:
    new_name=column.replace(" ","_")
    df.rename(columns={column:new_name},inplace=True)

In [9]:
df.head()

,gender,race/ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33

### 1. Find out how many males and females participated in the test.

In [10]:
df['gender'].value_counts()

female    518
male      482
Name: gender, dtype: int64

#### Insight
#### The participation of female is more than that of male.

### 2. What do you think about the students' parental level of education?

In [11]:
df['parental_level_of_education'].value_counts()

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental_level_of_education, dtype: int64

In [12]:
df['parental_level_of_education'].describe()

count             1000
unique               6
top       some college
freq               226
Name: parental_level_of_education, dtype: object

#### Insights
- **The students parental level of education is more for some college and least for master's degree.**

### 3. Who scores the most on average for math, reading and writing based on 
### ● Gender

In [13]:
df.groupby('gender')['math_score','reading_score','writing_score'].mean()

        math_score  reading_score  writing_score
gender
female   63.376448      72.590734      72.467181
male     68.821577      65.545643      63.446058

#### Insights
- **The male scores the most on average for math based on Gender.**
- **The female scores the most on average for reading based on Gender.**
- **The female scores the most on average for writing based on Gender.**

### ● Test preparation course

In [14]:
df.groupby('test_preparation_course')['math_score','reading_score','writing_score'].mean()

                         math_score  reading_score  writing_score
test_preparation_course
completed                  69.96648      74.175978      74.684358
none                       63.78972      66.417445      64.457944

#### Insights
- **The completed scores the most on average for math, reading and writing based on Test preparation course.**

### 4. What do you think about the scoring variation for math, reading and writing based on 
###     ● Gender

In [15]:
df.groupby('gender')['math_score','reading_score','writing_score'].var()

        math_score  reading_score  writing_score
gender
female  256.958593     207.677438     220.369327
male    211.889097     200.211010     202.413924

#### Insights
- **The female has the most scoring variation for math, reading and writing based on  Gender.**

###     ● Test preparation course

In [16]:
df.groupby('test_preparation_course')['math_score','reading_score','writing_score'].var()

                         math_score  reading_score  writing_score
test_preparation_course
completed                210.884027     183.265864     175.202612
none                     246.668662     213.419851     226.251739

#### Insights
- **The none has the most scoring variation for math, reading and writing based on Test preparation course.**

### 5. The management needs your help to give bonus points to the top 25% of students based on their maths score, so how will you help the management to achieve this.

In [19]:
df.describe()

        math_score  reading_score  writing_score
count  1000.000000    1000.000000    1000.000000
mean     66.001000      69.195000      68.119000
std      15.569567      14.706436      15.226381
min       0.000000      17.000000      10.000000
25%      57.000000      59.000000      58.000000
50%      66.000000      70.000000      69.000000
75%      77.000000      79.250000      79.000000
max     100.000000     100.000000     100.000000

In [18]:
df['math_score'].loc[df['math_score']>76]

414     77
415     77
416     77
417     77
418     77
      ...
995     99
996    100
997    100
998    100
999    100
Name: math_score, Length: 255, dtype: int64